Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པར་འགྱུར་ཏེ། དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་དང་བདུན་འབྱུང་བར་འགྱུར་རོ།
en: He will also have seven precious possessions, which are the precious wheel, the precious elephant, the precious horse, the precious wife, the precious jewel, the precious steward, and the precious minister.

source: །དེ་ལ་བུ་སྟོང་ཡོད་པར་འགྱུར་ཏེ། དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་འཇོམས་པ་ཤ་སྟག་འབྱུང་བར་འགྱུར་རོ།
en: He will beget one thousand sons, who will all be heroic, brave, handsome, and triumphant.

source: །དེ་ནི་ས་ཆེན་པོའི་དཀྱིལ་འཁོར་འདི་རྒྱ་མཚོའི་མཐའ་སྐོར་དང་བཅས་པ་ཆད་པ་མེད་ཅིང་མཚོན་གྱིས་བདའ་བ་མེད་པ་དང་། ཆོས་དང་འཐུན་པར་རང་གི་མཐུས་ཟིལ་གྱིས་མནན་ཅིང་མངོན་པར་ཕབ་སྟེ།
en: By his innate strength, he will subdue and conquer the entire world and its oceans without using force or weapons, and in a way that accords with the doctrine.

source: དབང་ཕྱུག་གི་དབང་གིས་རྒྱལ་སྲིད་བྱེད་པར་འགྱུར་རོ།
en: In this way the entire world will be his kingdom.

source: །དེ་གལ་ཏེ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་ཏེ།
en: If, however, he leaves his home and goes forth as a renunciant, he will become a thus-gone one, a worthy one, a completely perfect buddha.

source: སྟོན་པ་འདྲེན་པ་གཞན་གྱི་དྲིང་མི་འཇོག་པ། འཇིག་རྟེན་དུ་སྒྲ་རྣམ་པར་གྲགས་པར་འགྱུར་རོ།
en: He will become a teacher and a guide who is independent of others and renowned throughout the world.

source: །དེ་ལྟ་བས་ན་ཚུར་ཤོག་དེ་ལྟར་འདོང་ངོ་།
en: So come, let us go and see him.”

source: །དེ་ནས་དྲང་སྲོང་ཆེན་པོ་ནག་པོ་སྣག་གི་ཚ་བོ་མིས་བྱིན་དང་འགྲོགས་ཏེ། ངང་པའི་རྒྱལ་པོ་ལྟར་ནམ་མཁའི་དཀྱིལ་ནས་ལྡིངས་ཏེ་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། རྫུ་འཕྲུལ་བརྟུལ་ནས་རྐང་གིས་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་དོང་སྟེ། རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་ག་ལ་བ་དེར་ཕྱིན་ནས། རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་གྱི་སྒོར་བསྡད་དོ། །
en: Just like the king of swans, the great sage Asita, accompanied by his nephew Naradatta, soared through the sky to the city of Kapilavastu. When he arrived, he concealed his magical powers and entered the city on foot.

source: དགེ་སློང་དག་དེ་ལྟར་དྲང་སྲོང་ནག་པོ་དེས་རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་གྱི་སྒོ་དྲུང་དུ་སྲོག་ཆགས་བརྒྱ་སྟོང་མང་པོ་འདུས་པ་མཐོང་ངོ་།
en: He went to the palace of King Śuddhodana and walked right up to the palace gates where, monks, he saw many hundreds of thousands of animals gathered.

source: །དེ་ནས་དྲང་སྲོང་ནག་པོ་སྒོ་བའི་དྲུང་དུ་སོང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The sage Asita went to the gatekeeper and told him,

source: །ཀྱེ་མི་ཁྱོད་སོང་ལ་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་ཆབ་སྒོ་ན་དྲང་སྲོང་ཞིག་མཆིས་སོ་ཞེས་གསོལ་ཅིག །
en: “Sir! Go and tell King Śuddhodana that a sage has come to see him.”

source: དེ་ནས་སྒོ་བ་དེས་དེ་ལྟར་བགྱིའོ་ཞེས་དྲང་སྲོང་ནག་པོའི་ལྟར་མཉན་ཏེ། རྒྱལ་པོ་ཟས་གཙང་མ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་ཐལ་མོ་སྦྱར་ཏེ། རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The gatekeeper went before King Śuddhodana with folded hands and said,

source: ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ཆབ་སྒོ་ན་དྲང་སྲོང་རྒན་པོ་འཁོགས་པ་ནས་གཟེར་བ་ཞིག་མཆིས་ཏེ། འདི་སྐད་དུ་བདག་ནི་རྒྱལ་པོའི་ཞལ་མཐོང་བར་འཚལ་ལོ་ཞེས་མཆིའོ།
en: “Your Majesty! There is an old, elderly, and decrepit sage at the gate, who says that he wishes to see the king.”

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་དྲང་སྲོང་ནག་པོའི་སྟན་འདིང་དུ་བཅུག་སྟེ། མི་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: King Śuddhodana had a seat prepared for the sage Asita and said to the gatekeeper, “Let the sage enter.”

source: །དྲང་སྲོང་དེ་ནང་དུ་འོང་བར་གྱིས་ཤིག །དེ་ནས་མི་དེ་རྒྱལ་པོའི་ཕོ་བྲང་ནས་བྱུང་ནས། དྲང་སྲོང་ནག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་ཏེ། ནང་དུ་བཞུད་ཅིག །
en: The gatekeeper returned from the king’s quarters and told the sage Asita to enter the palace.

source: དེ་ནས་དྲང་སྲོང་ནག་པོ་རྒྱལ་པོ་ཟས་གཙང་མ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། མདུན་དུ་འདུག་སྟེ་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་བར་སྤྱོན་ཅིག །རྒྱལ་བར་སྤྱོན་ཅིག །སྐུ་ཚེ་རིང་བར་སྲུངས་ཤིག །ཆོས་བཞིན་དུ་རྒྱལ་པོ་མཛོད་ཅིག །
en: The sage Asita went before King Śuddhodana and told him, “Great King, may you be victorious! May you be victorious! May you live long! May you rule in accord with the Dharma!”

source: དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་དྲང་སྲོང་ནག་པོ་ལ་ཡོན་ཆུ་དང་རྐང་པ་ལ་གཏོར་བའི་ཆུས་མཆོད་པ་བྱས་ཏེ་ཤིན་ཏུ་ལེགས་པར་ཡོངས་སུ་བཀུར་ནས་སྟན་ལ་བདར་ཏེ།
en: King Śuddhodana first honored the sage by giving him water to bathe his feet and rinse his mouth. He then very respectfully seated him on a cushion.

source: དེ་སྟན་ལ་བདེ་བར་འདུག་པར་ཤེས་ནས་ཞེ་ས་དང་བཅས། གུས་དང་བཅས་པར་འདི་སྐད་ཅེས་སྨྲས་སོ། ། དྲང་སྲོང་སྔོན་མཐོང་བར་མི་དྲན་ན་འདིར་ཅི་ལ་བྱོན་ཅི་ཞིག་བཞེད།
en: Once he saw that the sage was sitting comfortably, he respectfully addressed him, “Sage, I do not recall having seen you before. Why have you come here?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དྲང་སྲོང་ནག་པོས་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་སྲས་ཤིག་བལྟམ་པར་གྱུར་པ་དེ་ལྟ་ཞིང་བདག་འདིར་མཆིས་སོ། །
en: The sage Asita replied to King Śuddhodana, “Great King, I have come to see the son who was born to you.”

source: རྒྱལ་པོས་སྨྲས་པ། དྲང་སྲོང་ཆེན་པོ་གཞོན་ནུ་ཉལ་ཞིང་མཆིས་ཀྱིས་ལངས་ཀྱི་བར་དུ་ཆུང་ཟད་ཅིག་གཞེས་ཤིག །
en: The king said, “Great Sage, the child is sleeping now. Please wait for a short while until he wakes.”

source: དྲང་སྲོང་གིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་སྐྱེས་བུ་ཆེན་པོ་དེ་ལྟ་བུ་ནི་རིང་པོར་མི་ཉལ་ཏེ།
en: The sage replied, “Great King, a great being like this does not sleep long.

source: སྐྱེས་བུ་དམ་པ་དེ་ལྟ་བུ་དག་ནི་སད་པར་གནས་པའི་ངང་ཚུལ་ཅན་ནོ།
en: Great beings like him usually remain awake.”

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དྲང་སྲོང་ནག་པོ་དེ་ལ་སྙིང་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་སད་པའི་བརྡ་བྱས་སོ།
en: Monks, out of affection for the sage Asita, the Bodhisattva now showed signs of having awakened.

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ལག་པ་གཉིས་ཀྱིས་ཤིན་ཏུ་ལེགས་པར་བླངས་ཏེ། དྲང་སྲོང་ནག་པོའི་དྲུང་དུ་ཁྱེར་རོ།
en: King Śuddhodana carefully lifted Prince Sarvārthasiddha with both hands and carried him before the sage Asita.

source: །དེ་ནས་དྲང་སྲོང་ནག་པོས་བྱང་ཆུབ་སེམས་དཔའ་བལྟས་ན། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་ཞིང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལེགས་པར་རྣམ་པར་སྤྲས་པའི་ལུས་དང་ལྡན་པ།
en: When the sage Asita looked at the Bodhisattva, he saw that his body was wonderfully adorned with the thirty-two marks and eighty signs of a great being.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལས་འཕགས་པའི་ལུས་ཅན་ཉི་མ་བརྒྱ་ཕྲག་སྟོང་ལས་ཀྱང་ལྷག་པའི་གཟི་བརྗིད་དང་ལྡན་པ། ཡན་ལག་ཐམས་ཅད་དུ་མཛེས་པ་མཐོང་ནས།
en: His body was superior even to that of Śakra, Brahmā, and the guardians of the world. It was even more splendorous than hundreds of thousands of suns, and all of its parts were perfectly beautiful.

source: ཀྱེ་མ་འཇིག་རྟེན་དུ་ངོ་མཚར་གྱི་གང་ཟག་འདི་བྱུང་ངོ་།
en: The sage exclaimed, “Oh! An amazing being has been born in this world!

source: །ཀྱེ་མ་འཇིག་རྟེན་དུ་ངོ་མཚར་ཆེན་པོ་དང་ལྡན་པའི་གང་ཟག་འདི་བྱུང་ངོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་ནས། སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་ནས། བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། བསྐོར་བ་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་པང་དུ་བླངས་ཏེ། སེམས་ཞིང་འདུག་པར་གྱུར་ཏོ། །
en: An exceptional and amazing being has been born in this world!” He stood up from his seat, joined his palms, prostrated to the Bodhisattva’s feet, and circumambulated him.

source: དེ་ནས་དེས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོད་པ་མཐོང་སྟེ། དེ་དག་དང་ལྡན་པའི་སྐྱེས་བུ་གང་ཟག་དེ་རྣམ་པ་གཉིས་སུ་འགྱུར་གྱི། གཞན་དུ་མི་འགྱུར་རོ། །
en: He then took the Bodhisattva on his lap and remained pensive. He saw that the Bodhisattva’s body bore the thirty-two marks of a great being, and he knew that these marks could only indicate one of two possibilities.

source: གལ་ཏེ་ཁྱིམ་ན་གནས་ན་ནི་མཐའ་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ནས་སྔ་མ་བཞིན་དུ་དབང་ཕྱུག་གི་དབང་གིས་རྒྱལ་སྲིད་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དུ་འགྱུར་བ་དང་།
en: He saw that if the Bodhisattva was to stay in the palace, he would become a universal monarch who commands the four armies. He would be a victorious and pious Dharma king with the necessary strength to govern.

source: གལ་ཏེ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི་དེ་བཞིན་གཤེགས་པར་འགྱུར་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྲགས་པ་འདྲེན་པ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་འགྱུར་བ་མཐོང་ནས། དེས་དེ་ལྟ་བུ་མཐོང་བ་དང་། མཆི་མ་བླགས་ཏེ་ངུས་ནས་ཤུགས་རིང་དུ་ཕྱུང་བ་དང་། རྒྱལ་པོ་ཟས་གཙང་མས་དྲང་སྲོང་དེ་མཆི་མ་བླགས་ཏེ་ངུས་ནས་ཤུགས་རིང་དུ་འབྱིན་པར་མཐོང་ནས། སྔངས་ཏེ་མི་དགའ་ཞིང་རིངས་པར་རིངས་པར་དྲང་སྲོང་ཆེན་པོ་དེ་ལ་སྨྲས་པ།
en: On the other hand, if he were to leave his home and go forth as a renunciant, he would become a thus-gone one, renowned as the completely perfect Buddha, a peerless leader. As the sage saw this, tears streamed down his face and he sat there sobbing. Seeing the sage crying, shedding tears and sobbing, the king became afraid and distressed, and he very quickly inquired of the great sage,

source: དྲང་སྲོང་དེ་ལྟར་བཤུམ་མོ་བླགས་ཏེ་བཤུམས་པ་དང་། ཤུགས་རིང་དུ་འབྱིན་པ་ཅི་ཞིག་ནོངས།
en: “Sage! You shed tears, you cry, and you sigh deeply. What is wrong?

source: །གཞོན་ནུ་འདི་ལ་མི་དགེ་བའམ་ཅིག་མི་གདའ་འམ།
en: Is some misfortune to befall the prince?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དྲང་སྲོང་ཆེན་པོ་ནག་པོས་རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་བདག་ནི་གཞོན་ནུའི་སླད་དུ་ངུ་བ་ཡང་མ་ལགས། འདི་ལ་མི་དགེ་བ་ཡང་གང་ཡང་མ་མཆིས་ཏེ། བདག་ཉིད་ངུ་བར་བས་སོ། །
en: The great sage Asita replied to the king, “Great King, I am not crying for sake of the prince, and no misfortune will befall him. I cry for myself because, Great King, I am elderly, old, and decrepit.

source: རྒྱལ་པོ་ཆེན་པོ་བདག་ནི་རྒས་ཤིང་འཁོགས་ཏེ་ནས་གཟེར་ལ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་འདི་ནི་གདོན་མི་འཚལ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷ་འམ། བདུད་དམ། ཚངས་པའམ། གཞན་སུས་ཀྱང་རུང་སྟེ། འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་བསྐོར་བར་མི་ནུས་བསྐོར་བར་འགྱུར་རོ།
en: Prince Sarvārthasiddha, however, will awaken to perfect and complete buddhahood and turn the wheel of the unexcelled Dharma in a way that cannot be done by any ascetic, priest, god, demon, or anybody else who follows worldly teachings.

source: །ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་སྨན་པ་དང་བདེ་བའི་སླད་དུ་ཆོས་སྟོན་པར་འགྱུར་ཏེ།
en: He will teach in a way that is beneficial and brings happiness to the world, including the gods.

source: ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བའི་ཆོས།
en: He will share a teaching of pure conduct, which is good in the beginning, good in the middle, and good in the end.

source: དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ།
en: It will be a teaching with excellent meaning and excellent words.

source: མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བའི་མཐར་ཕྱིན་པའི་ཆོས་ཡང་དག་པར་སྟོན་པར་འགྱུར་རོ། །
en: It will be unique, perfect, pure, purifying, and consummate.

source: སེམས་ཅན་སྐྱེ་བའི་ཆོས་ཅན་དག་འདི་ལས་ཆོས་དེ་ཐོས་ནས། སྐྱེ་བ་ལས་ཡོངས་སུ་མ་གྲོལ་བ་རྣམས་གྲོལ་བར་འགྱུར་རོ།
en: “When those who are bound within the caste system hear his teaching, those who are not free from birth will be liberated.

source: །དེ་བཞིན་དུ་སེམས་ཅན་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པའི་ཆོས་ཅན་རྣམས་ནི་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་ཡོངས་སུ་འགྲོལ་བར་འགྱུར།
en: Likewise those who are afflicted by old age, sickness, death, grief, lamentation, suffering, unhappiness, and irritation will be liberated from old age, sickness, death, grief, lamentation, suffering, unhappiness, and irritation.

source: སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་མེས་གདུངས་པ་རྣམས་ལ་ནི་དམ་པའི་ཆོས་ཀྱི་ཆར་པས་སིམ་པར་མཛད་པར་འགྱུར།
en: The rain of the sublime teaching will refresh those who are tormented by the flames of desire, anger, and stupidity.

source: སེམས་ཅན་ལྟ་བ་ངན་པ་སྣ་ཚོགས་ཐིབས་པོས་ཁེབས་པ་ལམ་གོལ་བར་ཞུགས་པ་རྣམས་ནི་ལམ་དྲང་པོར་མྱ་ངན་ལས་འདས་པར་འདྲེན་པར་འགྱུར།
en: “He will lead onto the straight path to nirvāṇa those beings who are veiled by a variety of mistaken views and who have entered mistaken paths.

source: སེམས་ཅན་འཁོར་བའི་དྲ་བ་དང་བཙོན་རར་འཁོར་ཞིང་ཉོན་མོངས་པའི་འཆིང་བས་བཅིངས་པ་རྣམས་ནི་བཅིངས་པ་ལས་ཡོངས་སུ་གྲོལ་བར་མཛད་པར་འགྱུར།
en: He will free from bondage those who are trapped in the cage and prison of saṃsāra and who are bound by the fetters of disturbing emotions.

source: སེམས་ཅན་མི་ཤེས་པའི་མུན་པ་དང་། རབ་རིབ་དང་། ལིང་ཏོག་གིས་མིག་ལྡོངས་པ་རྣམས་ལ་ནི་ཤེས་རབ་ཀྱི་མིག་སྐྱེད་པར་འགྱུར།
en: In those beings who are blinded by darkness, clouded vision, and the cataract of ignorance, he will engender the eye of insight.

source: སེམས་ཅན་ཉོན་མོངས་པའི་ཟུག་རྔུས་ཟུག་པ་རྣམས་ལ་ནི་ཟུག་རྔུ་འབྱིན་པར་འགྱུར་ཏེ།
en: For those beings who are wounded by the thorn of disturbing emotions, he will pull out that thorn.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ་དཔེར་ན་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ནི་བརྒྱ་ལ་བརྒྱ་ལམ་ན་འཇིག་རྟེན་དུ་འབྱུང་ངོ་།
en: Great King, an uḍumbara flower sometimes, though rarely, blooms in the world.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་དུ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོར་བརྒྱ་ལ་བརྒྱ་ལམ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་སྟེ།
en: Great King, in the same way, rarely, once in many millions of years, a blessed buddha is born in the world.

source: དེ་ལྟར་གཞོན་ནུ་འདི་ནི་ངེས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: And this great prince will certainly awaken to unexcelled, perfect, and complete buddhahood.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འཁོར་བའི་རྒྱ་མཚོའི་ཕ་རོལ་ཏུ་སྒྲོལ་བར་འགྱུར་ཞིང་འཆི་བ་མེད་པ་ལ་རབ་ཏུ་གཞོག་པར་འགྱུར་ལ།
en: “Once he awakens to unexcelled, perfect, and complete buddhahood, he will liberate many billions of beings, bringing them across the ocean of saṃsāra and establishing them in immortality.

source: བདག་གིས་ནི་སངས་རྒྱས་དཀོན་མཆོག་དེ་མི་མཐོང་བ་དང་། བདག་གི་ནད་མ་མཆིས་པ་འདི་ལ་ཡང་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ཏེ།
en: Yet I shall not live to see this jewel of the Buddha.

source: རྒྱལ་པོ་ཆེན་པོ་བདག་ནི་དེའི་སླད་དུ་ངུ་ཞིང་མི་དགའ་བས་ཤུགས་རིང་དུ་འབྱིན་པ་ལགས་སོ།
en: This is why, Great King, I cry and sigh so sadly.

source: །རྒྱལ་པོ་ཆེན་པོ་བདག་ཅག་གི་བསྟན་བཅོས་ལས་འབྱུང་བ་ལྟ་ན་ནི་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ཡང་ཁབ་ན་བཞུགས་པར་མི་འགྱུར་རོ།
en: I will not be able to venerate him, even if I remain healthy. “Great King, if you look in our scriptures, you will see that the prince Sarvārthasiddha will not stay at home.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་འདི་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་སྟེ།
en: The reason is, Great King, that the prince Sarvārthasiddha bears the thirty-two marks of a great being.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་དབུ་གཙུག་ཏོར་དང་ལྡན་པ་སྟེ།
en: “(1) Great King, Prince Sarvārthasiddha has a crown extension.

source: རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་དང་པོ་འདི་དང་ལྡན་ནོ།
en: That, Great King, is the first mark of a great being found on Prince Sarvārthasiddha.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་དབུ་སྟང་ཟིལ་བཅག་པའི་འཕྲོ་དང་རྨ་བྱའི་མགྲིན་པ་ལྟར་མཐོན་མཐིང་དུ་གྲུབ་ཅིང་ལྕང་ལོར་འཁྲིལ་ལ་གཡས་སུ་འཁྱིལ་བ་དང་། འཕྲལ་བའི་དབྱེས་མཉམ་པ་ལགས་སོ།
en: (2) Great King, Prince Sarvārthasiddha’s hair is deep blue like the neck of a peacock or kohl powder, and curls to the right. (3) His forehead is even.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པའི་སྨིན་མཚམས་སུ་མཛོད་སྤུ་སྐྱེས་པ་ནི་ཁ་བ་དང་དངུལ་གྱི་མདོག་ལྟར་མཆིས་པ་ལགས་སོ།
en: (4) Great King, at the place between Sarvārthasiddha’s eyebrows, there is a ringlet of hair the color of snow or silver.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སྤྱན་གྱི་རྫི་མ་བའི་རྫི་མ་ལྟ་བུ་དང་། སྤྱན་དཀར་ནག་འབྱེས་པ་དང་། ཚེམས་བཞི་བཅུ་མཉམ་པ་དང་། ཚེམས་ཐགས་བཟང་བ་དང་། ཚེམས་ཤིན་ཏུ་དཀར་བ་དང་ལྡན་པ་ལགས་སོ།
en: (5) Great King, Prince Sarvārthasiddha’s eyelashes are like those of a bull. (6) His eyes are of a deep blue color. (7) He has forty teeth. (8) He has even teeth. (9) His teeth are without gaps between them. (10) His teeth are perfectly white.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཚངས་པའི་དབྱངས་དང་། རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་དང་། ལྗགས་ཤིན་ཏུ་རིང་ཞིང་སྲབ་པ་དང་། འགྲམ་པ་སེང་གེའི་འདྲ་བ་དང་། དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་པ་དང་། བདུན་མཐོ་བ་དང་། ཐལ་གོང་རྒྱས་པ་དང་། པགས་པ་སྲབ་ཅིང་མདོག་གསེར་འདྲ་བ་དང་། བཞེངས་བཞིན་དུ་མ་བཏུད་པར་ཕྱག་པུས་མོར་སླེབས་པ་དང་། རོ་སྟོད་སེང་གེའི་ལྟ་བུ་དང་ལྡན་པ་ལགས་སོ།
en: (11) Great King, Prince Sarvārthasiddha has the voice of Brahmā. (12) His experience of taste is unexcelled. (13) His tongue is very long and slender. (14) His jaw is like that of a lion. (15) His shoulders are well-rounded. (16) Seven of his body parts are well-rounded. (17) His chest is broad. (18) His skin is smooth and golden. (19) When standing up straight, his hands reach his knees. (20) His torso is like that of a lion.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་དང་། སྤུ་རེ་རེ་ནས་སྐྱེས་པ་དང་། ཡན་ལག་གི་སྤུ་གཡས་ཕྱོགས་ནས་གྱེན་དུ་འཁྱིལ་བ་དང་། མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་དང་། བརླ་ལེགས་པར་ཟླུམ་པ་དང་། བྱིན་པ་རི་དགས་ཀྱི་རྒྱལ་པོ་ཨེ་ན་ཡའི་ལྟ་བུ་དང་། སོར་མོ་རིང་བ་དང་། ཞབས་ཀྱི་རྟིང་པ་ཡངས་པ་དང་། ཞབས་ཀྱི་གོང་མཐོ་བ་དང་། ཕྱག་དང་ཞབས་ཀྱི་མཐིལ་འཇམ་པ་དང་། ཕྱག་དང་ཞབས་ཀྱི་སོར་མོ་དྲ་བས་འབྲེལ་བ་དང་ལྡན་པ་ལགས་སོ།
en: (21) Great King, Prince Sarvārthasiddha’s arm span and height are identical, like the banyan tree. (22) Each of his hairs grows individually, and their tips curl to the right and upward. (23) His private parts are well sheathed. (24) His thighs are well-rounded. (25) His calves are like those of the black antelope, the king of deer. (26) His fingers are long. (27) His heels are broad. (28) His arches are high. (29) His palms and the soles of his feet are soft. (30) His fingers and toes are webbed.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པའི་ཞབས་ཀྱི་འོག་གི་མཐིལ་གཉིས་ལ་འཁོར་ལོ་རེ་རེ་སྐྱེས་པ་ནི་བཟང་ཞིང་རྩིབས་སྟོང་དང་ལྡན་ལ། མུ་ཁྱུད་དང་བཅས། ལྟེ་བ་དང་བཅས་པ་ལགས་སོ། །
en: (31) Great King, on the palms of his long-fingered hands and on the soles of his long-toed feet, there are beautiful thousand-spoked wheels with both center and rim.

source: རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཞབས་མཉམ་ཞིང་ཤིན་ཏུ་གནས་པ་དང་ལྡན་པ་ལགས་སོ།
en: (32) Great King, Prince Sarvārthasiddha has even and well-placed feet.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་དང་ལྡན་ནོ།
en: “Great King, Prince Sarvārthasiddha possesses these thirty-two marks of a great being.

source: །རྒྱལ་པོ་ཆེན་པོ་མཚན་གྱི་རྣམ་པ་དེ་ལྟ་བུ་དག་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་མི་འབྱུང་སྟེ།
en: Great king, marks of this type are not found on the body of a universal monarch;

source: མཚན་དེ་ལྟ་བུ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འབྱུང་ངོ་།
en: these are the marks found on the body of a bodhisattva.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པའི་སྐུ་ལ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་མཆིས་ཏེ།
en: “Great King, the body of Prince Sarvārthasiddha is adorned with eighty minor marks.

source: དེ་དག་དང་ལྡན་པས་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཁབ་ན་བཞུགས་པར་མི་འགྱུར་གྱི། གདོན་མི་འཚལ་བར་རབ་ཏུ་འབྱུང་བའི་དོན་དུ་མངོན་པར་འབྱུང་བར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་པོ་དེ་དག་གང་ཞེ་ན།
en: Because he has these signs, Prince Sarvārthasiddha will not stay at home, but will certainly develop renunciation and depart from his home. Great King, what are these eighty minor marks?

source: འདི་ལྟ་སྟེ་རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སེན་མོ་མཐོ་བ་དང་། སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུ་དང་། སེན་མོ་མདོག་སྣུམ་པ་དང་། སོར་མོ་རྣམས་ཟླུམ་པ་དང་། སོར་མོ་རྣམས་རྒྱས་པ་དང་། སོར་མོ་བྱིན་གྱིས་ཕྲ་བ་དང་། རྩ་མི་མངོན་པ་དང་། ལོང་བུ་མི་མངོན་པ་དང་། ཚིགས་མི་མངོན་པ་དང་། ཞབས་མཉམ་ཞིང་མི་མཉམ་པ་མ་མཆིས་པ་དང་། ཞབས་ཀྱི་རྟིང་པ་ཡངས་པ་དང་ལྡན་པ་ལགས་སོ།
en: Well, Great King, (1) Prince Sarvārthasiddha’s fingernails are rounded, (2) copper colored, and (3) glossy. (4) His fingers and toes are rounded, (5) long, and (6) well proportioned. (7) His veins are not visible. (8) His anklebones are not visible. (9) His joints are not visible. (10) His feet are even, rather than uneven. (11) His heels are broad.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་ཕྱག་གི་རི་མོ་མཚུངས་པ་དང་ལྡན་ཞིང་ཕྱག་གི་རི་མོ་མདངས་ཡོད་པ་དང་། ཕྱག་གི་རི་མོ་ཟབ་པ་དང་། ཕྱག་གི་རི་མོ་ཡ་ཡོར་མ་གྱུར་པ་དང་། ཕྱག་གི་རི་མོ་རིམ་པར་འཚམ་པ་དང་། སྒྲོས་བིམ་པ་ལྟར་དམར་བ་དང་། སྒྲ་མི་གྲག་པའི་ཚིག་དང་། ལྗགས་མཉེན་ཞིང་འཇམ་ལ་ཟངས་ཀྱི་མདོག་ལྟར་འདུག་པ་དང་། གླང་པོ་ཆེའི་ང་རོ་དང་། འབྲུག་གི་སྒྲ་དང་ལྡན་པ་དང་། སྙན་ཅིང་འཇམ་པ་དང་ལྡན་པ་ལགས་སོ།
en: Great King, (12) Prince Sarvārthasiddha has markings on his hands that are even, (13) clear, (14) deep, (15) straight, and (16) well arranged. (17) His lips are red like the bimba fruit. (18) His voice is not loud. (19) His tongue is supple, soft, and copper colored. (20) His voice is melodious like the trumpeting of an elephant, or the roll of thunder. “Moreover, (21) his arms are long. (22) He is excellently clean. (23) His body is soft. (24) His body is not subject to fear or hesitancy. (25) His body is well proportioned, (26) heroic, (27) beautiful, and (28) well composed. (29) His kneecaps are broad, large, and well-developed.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པ་སྟེ། ཕྱག་རིང་བ་དང་། སྐུའི་ན་བཟའ་གཙང་མ་ཕུན་སུམ་ཚོགས་པ་དང་། སྐུ་འཇམ་པ་དང་། བསྙེངས་པ་མི་མངའ་བའི་སྐུ་དང་། ཞུམ་པ་མི་མངའ་བའི་སྐུ་དང་། རིམ་པར་འཚམ་པའི་སྐུ་དང་། ཤིན་ཏུ་དཔའ་བར་མཛེས་པའི་སྐུ་དང་། རྣམ་པར་ལེགས་པར་གྲུབ་པའི་སྐུ་དང་། པུས་མོའི་ལྷ་ང་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་ཤིན་ཏུ་གང་བ་དང་ལྡན་པ་ལགས་སོ།
en: Great King, (30) Prince Sarvārthasiddha’s body is rounded, (31) very smooth, (32) straight, and (33) well structured. (34) His navel is deep, (35) not crooked, and (36) tapering. (37) Like a sage, he is very pure in his conduct. (38) He is exceedingly attractive, (39) of pure appearance, and (40) shines with a light that dispels all darkness.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་སྐུ་ཟླུམ་པ་དང་ལྡན་པ་སྟེ། སྐུ་ཤིན་ཏུ་འཇམ་པ་དང་། སྐུ་ཡ་ཡོ་མ་མཆིས་པ་དང་། སྐུ་རིམ་གྱིས་ལེགས་པར་གྲུབ་པ་དང་། ལྟེ་བ་ཟབ་པ་དང་། ལྟེ་བ་མ་ཡོ་བ་དང་། ལྟེ་བ་རིམ་གྱིས་གཞོལ་བ་དང་། དྲང་སྲོང་ལྟར་གཙང་སྦྲས་སྤྱོད་པ་དང་། ཀུན་ནས་མཛེས་པ་དང་། སྣང་བ་དམ་པ་ཤིན་ཏུ་རྣམ་པར་དག་ཅིང་།
en: “Great King, (41) Prince Sarvārthasiddha moves with the serene gait of an elephant, (42) the stride of a lion, (43) the step of a great bull, (44) the swoop of a swan. (45) His steps always make beautiful circles to the right. (46) His sides are rounded, (47) well proportioned, and (48) straight. (49) His waist is slight like the curve of a bow. (50)

source: རབ་རིབ་མ་མཆིས་པའི་འོད་ཀུན་ནས་འབྱུང་བ་དང་ལྡན་པ་ལགས་སོ།
en: His body is free of any blemishes or dark spots.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་གླང་པོ་ལྟར་དལ་བའི་འགྲོས་དང་། སེང་གེའི་སྟབས་ལྟ་བུའི་འགྲོས་དང་། ཁྱུ་མཆོག་གི་སྟབས་ལྟ་བུའི་འགྲོས་དང་། ངང་པའི་སྟབས་ལྟ་བུའི་འགྲོས་དང་། གཡས་ཕྱོགས་སུ་མཛེས་པར་འཁོར་བའི་འགྲོས་དང་། དཀུ་ཟླུམ་པ་དང་། དཀུ་སྐབས་ཕྱིན་པ་དང་། དཀུ་མ་རྙོངས་པ་དང་། རྐེད་པ་གཞུའི་ཆང་ཟུངས་ལྟར་ཕྲ་བ་དང་། མདོག་གི་ཉེས་པ་སྔོ་བའམ། གནག་པའི་སྐྱོན་དང་བྲལ་བའི་སྐུ་དང་ལྡན་པ་ལགས་སོ།
en: Great King, (51) Prince Sarvārthasiddha has rounded canines. (52) His canines are sharp and well spaced. (53) His nose is elegantly high. (54) His eyes are clear, (55) stainless, (56) warm, (57) elongated, (58) large, and (59) resemble blue lotuses.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ནི་མཆེ་བ་ཟླུམ་པ་དང་། མཆེ་བ་རྣོ་བ་དང་། མཆེ་བ་བྱིན་གྱིས་ཕྲ་བ་དང་། ཤངས་ལེགས་པར་མཐོ་བ་དང་། སྤྱན་གསལ་བ་དང་། སྤྱན་དྲི་མ་མེད་པ་དང་། འཛུམ་པའི་སྤྱན་དང་ལྡན་པ་དང་། སྤྱན་རིང་བ་དང་། སྤྱན་ཡངས་པ་དང་། ཨུད་པ་ལ་སྔོན་པོ་ལྟ་བུའི་སྤྱན་དང་ལྡན་པ་ལགས་སོ།
en: “Great King, Prince Sarvārthasiddha has (60) even eyebrows that are (61) thick, (62) dark, (63) continuous, and (64) tapered. (65) His cheeks are plump, (66) even, (67) unblemished, and (68) free from the flush of aggression. (69) His sense organs are clearly apparent.
